Revit 2024 API
ExternalResourceTypes.BuiltInExternalResourceTypes.IFCLink Property
 An external resource type representing IFC links.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ExternalResourceType IFCLink { get; }
Visual Basic
Public Shared ReadOnly Property IFCLink As ExternalResourceType
	Get
Visual C++
public:
static property ExternalResourceType^ IFCLink {
	ExternalResourceType^ get ();
}
See Also
ExternalResourceTypes.BuiltInExternalResourceTypes Class
Autodesk.Revit.DB Namespace